===============EDA=========================

1) Pandas : data frame applications
2) Numpy : numerical python all math applications
3) Matplotlib: used for plotting
4) Seaborn : used for plot
5) Plotly : use for plot
6) Bokhe: plot
============ Machine learning =====================
7) Sickit-learn : sklearn
================ Deep learning ===================
8) Tensorflow : google
9) Keras : google
10) Pytorch: facebook
=============  NLP =================
11) NLTK : Natural language tool kit
12)  Scipy
========= BERT ===================
13) Transformers : Hugging face (google)
=========== Google models===========
14) Specific google packages
=========== Azure AI ===========
15) Azure packages
===============  Gen AI ==========
16) Gemiani : Google
17) ChartGPT: Opean AI
============ LangChain ==========
18) LangChain packages

**Create a data fram using list**

In [ ]:
- list === dictionary
-  dictionary === list

**step1= create data**

In [3]:

import pandas as pd
names=['Ayush','Avinash','Akask']
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

**step2=provide the data**

In [9]:

names=['Ayush','Avinash','Akask']
ages= ['25','30','20']
location=['mumbai','Bengaluru','hyd']
pd.DataFrame(zip(names, ages,location))
# what is the first postional argument: data
# second postional argument

         0   1          2
0    Ayush  25     mumbai
1  Avinash  30  Bengaluru
2    Akask  20        hyd

In [11]:
names=['Ayush','Avinash','Akask']
ages= ['25','30','20']
location=['mumbai','Bengaluru','hyd']
pd.DataFrame(zip(names, ages),location)

                 0   1
mumbai       Ayush  25
Bengaluru  Avinash  30
hyd          Akask  20

In [12]:
names=['Ayush','Avinash','Akask']
ages= ['25','30','20']
location=['mumbai','Bengaluru','hyd']
data=zip(names,ages)
pd.DataFrame(data,location)

                 0   1
mumbai       Ayush  25
Bengaluru  Avinash  30
hyd          Akask  20

In [15]:
names=['Ayush','Avinash','Akask']
ages= ['25','30','20']
location=['mumbai','Bengaluru','hyd']
pd.DataFrame(zip(names,ages,location),columns=['names','ages','location'])

     names ages   location
0    Ayush   25     mumbai
1  Avinash   30  Bengaluru
2    Akask   20        hyd

In [22]:
names=['Ayush','Avinash','Akask']
ages= ['25','30','20']
location=['mumbai','Bengaluru','hyd']
data=zip(names,ages,location)
clos=['Names','Ages','City']
df=pd.DataFrame(data,columns=clos)
df

     Names Ages       City
0    Ayush   25     mumbai
1  Avinash   30  Bengaluru
2    Akask   20        hyd

In [18]:
type(df)

pandas.core.frame.DataFrame

$step-4:$
**add new columns**

In [ ]:
- if you want to add new column
- first you need to check the no of rows in  already existed data
- for example

In [21]:
job=['DS','DA','CS']
df['Job']=job
df

     Names Ages       city Job
0    Ayush   25     mumbai  DS
1  Avinash   30  Bengaluru  DA
2    Akask   20        hyd  CS

In [25]:
#  step5= UPLOAD NEW DATA 
df['Job']=['DATA SCIENCE', 'DATA ANALYST', 'CYBER']
df

     Names Ages       City           Job
0    Ayush   25     mumbai  DATA SCIENCE
1  Avinash   30  Bengaluru  DATA ANALYST
2    Akask   20        hyd         CYBER

**step6-**
- change index

In [29]:
names=['Ayush','Avinash','Akask','Anusha']
ages= ['25','30','20','23']
location=['mumbai','Bengaluru','hyd','hyd']
data=zip(names,ages,location)
clos=['Names','Ages','City']
idx= ['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=clos)
df

     Names Ages       City
A    Ayush   25     mumbai
B  Avinash   30  Bengaluru
C    Akask   20        hyd
D   Anusha   23        hyd

**note**
- number of list equals to **number of columns**
- number of values inside list equals to **number of rows** 
- when you create the data all the lists will be in same length

$step7-$
- no of rows
- no of col

In [30]:
df.shape
print('the number of rows are :',df.shape[0])
print('the number of columns are :',df.shape[1])

the number of rows are : 4
the number of columns are : 3

$step-8$
**drop the columns**
- In order to drop column we required 3 arguments
- columns
    - The columns name we need to mention
- axis
    - axis=0 **represent rows**
    - axis=1 **represent columns**
- inplace
    - we are drop columns means we are modifing the data frame
    - so this modification we want to save in same variable or different variable 
    - if u want to keep in same variable the **inplace=True**

In [31]:
df

     Names Ages       City
A    Ayush   25     mumbai
B  Avinash   30  Bengaluru
C    Akask   20        hyd
D   Anusha   23        hyd

In [44]:
df.drop('Ages',axis=1,inplace=True)
df

     Names
A    Ayush
B  Avinash
C    Akask
D   Anusha

In [67]:
df.drop('City',axis=1)
df

KeyError: "['City'] not found in axis"

In [63]:
import pandas as pd
names=['Ayush','Avinash','Akask','Anusha']
ages= ['25','30','20','23']
city=['mumbai','Bengaluru','hyd','hyd']
data=zip(names,ages,location)
clos=['Names','Ages','City']
idx= ['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=clos)
df

     Names Ages       City
A    Ayush   25     mumbai
B  Avinash   30  Bengaluru
C    Akask   20        hyd
D   Anusha   23        hyd

In [64]:
df.drop('City',axis=1,inplace=True)
df

     Names Ages
A    Ayush   25
B  Avinash   30
C    Akask   20
D   Anusha   23

In [65]:
df.drop('Ages',axis=1,inplace=True)
df

     Names
A    Ayush
B  Avinash
C    Akask
D   Anusha

In [52]:
df.drop('C',axis=0,inplace=True)
df

     Names
A    Ayush
B  Avinash
D   Anusha

In [ ]:
$step-11$
**how to save the **
- generally data frame two types
- csv
- execl

In [59]:
# file name=data
# extenstion=.csv
df.to_csv('data.csv')
df.to_csv('data1.csv',index=False)

In [3]:
import pandas as pd
names=['Ayush','Avinash','Akask','Anusha']
ages= ['25','30','20','23']
location=['mumbai','Bengaluru','hyd','hyd']
data=zip(names,ages,location)
clos=['Names','Ages','City']
idx= ['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=clos)
df

     Names Ages       City
A    Ayush   25     mumbai
B  Avinash   30  Bengaluru
C    Akask   20        hyd
D   Anusha   23        hyd

In [7]:
df.drop('C',axis=0,inplace=True)
df

     Names Ages       City
A    Ayush   25     mumbai
B  Avinash   30  Bengaluru
D   Anusha   23        hyd

In [9]:
df.to_csv('data2.csv')

In [12]:
df.drop('Ages',axis=1,inplace=True)
df

KeyError: "['Ages'] not found in axis"

In [ ]:
df